In [37]:
import pandas as pd

In [24]:
import sqlite3
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query1 = """
        SELECT *
        FROM FACILITIES
        """
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main():
    database = "C:\\Users\\Diana\\sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
 
if __name__ == '__main__':
    main()

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

In [39]:
database = "C:\\Users\\Diana\\sqlite_db_pythonsqlite.db"
 
# create a database connection
conn = create_connection(database)

2.6.0

In [41]:
q1= """SELECT name FROM Facilities"""
df = pd.read_sql_query(q1,conn)
print(df)

              name
0   Tennis Court 1
1   Tennis Court 2
2  Badminton Court
3     Table Tennis
4   Massage Room 1
5   Massage Room 2
6     Squash Court
7    Snooker Table
8       Pool Table

In [105]:
q2="""SELECT name, rev 
    FROM (SELECT f.name, SUM(CASE WHEN b.memid >0 THEN (b.slots * f.membercost)
                                  WHEN b.memid=0 THEN (b.slots * f.guestcost) END)AS rev
            FROM Bookings AS b
            LEFT JOIN Members AS m
            USING(memid)
            LEFT JOIN Facilities as f
            USING(facid)
            GROUP BY f.name)AS 'R' 
    WHERE rev<1000
    ORDER BY rev DESC
    """
Q10 = pd.read_sql_query(q2,conn)
print(Q10)

            name  rev
0     Pool Table  270
1  Snooker Table  240
2   Table Tennis  180

In [122]:
q3=""" SELECT  b.surname , b.firstname ,  a.surname AS recomendedby_surname , a.firstname AS recomendedby_surname
FROM Members AS a
INNER JOIN Members AS b
ON a.memid=b.recommendedby
ORDER BY b.surname
"""

Q11 = pd.read_sql_query(q3,conn)
print(Q11)

              surname  firstname recomendedby_surname recomendedby_surname
0               Bader   Florence             Stibbons               Ponder
1               Baker       Anne             Stibbons               Ponder
2               Baker    Timothy              Farrell               Jemima
3              Boothe        Tim               Rownam                  Tim
4             Butters     Gerald                Smith               Darren
5              Coplin       Joan                Baker              Timothy
6             Crumpet      Erica                Smith                Tracy
7                Dare      Nancy             Joplette               Janice
8             Genting    Matthew              Butters               Gerald
9                Hunt       John              Purview            Millicent
10              Jones      David             Joplette               Janice
11              Jones    Douglas                Jones                David
12           Joplette     Janice                Smith               Darren
13          Mackenzie       Anna                Smith               Darren
14               Owen    Charles                Smith               Darren
15             Pinker      David              Farrell               Jemima
16            Purview  Millicent                Smith                Tracy
17             Rumney  Henrietta              Genting              Matthew
18             Sarwin  Ramnaresh                Bader             Florence
19              Smith       Jack                Smith               Darren
20           Stibbons     Ponder                Tracy               Burton
21  Worthington-Smyth      Henry                Smith                Tracy

In [140]:
q4=""" SELECT m.memid, m.surname, m.firstname , f.name, SUM(b.slots)
FROM Bookings AS b
LEFT JOIN Facilities AS f
USING(facid)
LEFT JOIN members AS m
USING(memid)
WHERE memid>0
GROUP BY m.memid
"""

Q12 = pd.read_sql_query(q4,conn)
print(Q12)

    memid            surname  firstname             name  SUM(b.slots)
0       1              Smith     Darren     Table Tennis           685
1       2              Smith      Tracy   Tennis Court 1           435
2       3             Rownam        Tim   Massage Room 1           660
3       4           Joplette     Janice   Massage Room 1           326
4       5            Butters     Gerald   Tennis Court 1           409
5       6              Tracy     Burton   Tennis Court 2           366
6       7               Dare      Nancy  Badminton Court           267
7       8             Boothe        Tim   Tennis Court 2           440
8       9           Stibbons     Ponder   Tennis Court 2           249
9      10               Owen    Charles   Tennis Court 1           345
10     11              Jones      David   Tennis Court 2           305
11     12              Baker       Anne   Tennis Court 1           296
12     13            Farrell     Jemima     Table Tennis           180
13     14              Smith       Jack   Massage Room 1           219
14     15              Bader   Florence  Badminton Court           237
15     16              Baker    Timothy   Tennis Court 2           290
16     17             Pinker      David    Snooker Table           159
17     20            Genting    Matthew   Massage Room 2           131
18     21          Mackenzie       Anna  Badminton Court           231
19     22             Coplin       Joan    Snooker Table           106
20     24             Sarwin  Ramnaresh   Tennis Court 2           153
21     26              Jones    Douglas  Badminton Court            37
22     27             Rumney  Henrietta    Snooker Table            38
23     28            Farrell      David   Tennis Court 1            50
24     29  Worthington-Smyth      Henry  Badminton Court            60
25     30            Purview  Millicent  Badminton Court            32
26     33         Tupperware   Hyacinth    Snooker Table            28
27     35               Hunt       John   Tennis Court 1            40
28     36            Crumpet      Erica  Badminton Court            17

In [186]:
q5=""" SELECT f.name, substring(STARTTIME, 6, 2) AS month , SUM(b.slots)
FROM Bookings AS b
LEFT JOIN Facilities AS f
USING(facid)
LEFT JOIN members AS m
USING(memid)
WHERE memid>0
GROUP BY month
"""

Q13 = pd.read_sql_query(q5,conn)
print(Q13)

             name month  SUM(b.slots)
0    Table Tennis    07          1061
1  Tennis Court 1    08          2531
2  Tennis Court 1    09          3199